---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.ScheduleType
source: html/3fb70110-d4d9-55ef-aac0-bd12df07786c.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.ScheduleType Property

The panel schedule type of this panel schedule

## Syntax (C#)
```csharp
public PanelScheduleType ScheduleType { get; }
```